app/controllers/api/v1/authentication_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'abc@xyz.com' LIMIT 1
---
  def authenticate

    unless User.find_by_email(params[:email]).present?