app/controllers/api/v1/email_controller.rb

  def inbox
    emails = Email.where("is_read is not null and user_id = ?", current_user.id).order('created_at desc')
---
SELECT `emails`.* FROM `emails` WHERE (is_read is not null and user_id = 1)  ORDER BY created_at desc

  def read_update
    Email.find(params[:email_id]).update(:is_read=>true)
---
SELECT `emails`.* FROM `emails` WHERE (is_read is not null and user_id = 2)  ORDER BY created_at desc
UPDATE `emails` SET `is_read` = 1, `updated_at` = '2017-08-10 12:44:42' WHERE `emails`.`id` = 4

  def save_draft
    Email.save_draft(params[:body], params[:subject], current_user.id)
---
INSERT INTO `emails` (`body`, `subject`, `is_draft`, `user_id`, `created_at`, `updated_at`) VALUES ('gjdsh', 'jgfsj', 1, 2, '2017-08-10 13:14:16', '2017-08-10 13:14:16')

  def get_draft
    emails = Email.where("is_draft = ? and user_id = ?", true, current_user.id)
---
SELECT `emails`.* FROM `emails` WHERE (is_draft => 1 and user_id => 2)

  def draft_update
  	Email.find(params[:email_id]).update(:body=> params[:body], :subject => params[:subject])
---
SELECT  `emails`.* FROM `emails` WHERE `emails`.`id` = 8 LIMIT 1
UPDATE `emails` SET `body` = 'gjdshhfgsdjfhgsdjsgfdsjssabhilash', `updated_at` = '2017-08-10 14:12:23' WHERE `emails`.`id` = 8

  def indentation
  	new_body = Email.find(params[:email_id]).body.gsub('\n\t','\n\t\t')
---
SELECT  `emails`.* FROM `emails` WHERE `emails`.`id` = 57 LIMIT 1